#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.aws_ebs_csi_driver_assume_role_document: Reading...
module.eks.data.aws_partition.current[0]: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/common-eks/cluster]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ce674b58c497dee8]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
data.aws_iam_policy_document.aws_ebs_csi_driver_assume_role_document: Read complete after 0s [id=819195744]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.aws_iam_role.this[0]: Refreshing state... [id=common-eks-cluster-20241226043235471800000001]
aws_iam_role.aws_ebs_csi_driver_assume_role: Refreshing state... [id=AmazonEBSCSIDriverRole]
module.eks.module.eks_managed_node_group["example"].aws_iam_role.this[0]: Refreshing state... [id=example-eks-node-group-20241226043235472400000003]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::183631350996:policy/common-eks-cluster-20241226043235471900000002]
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=183631350996]
module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=183631350996]
data.aws_caller_identity.current: Read complete after 0s [id=183631350996]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=183631350996]
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::183631350996:assumed-role/IaC-ReadOnly/GitHubActions]
module.eks.module.eks_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=example-eks-node-group-20241226043235472400000003-20241226043236403400000009]
module.eks.module.eks_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=example-eks-node-group-20241226043235472400000003-20241226043236391300000008]
module.eks.module.eks_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=example-eks-node-group-20241226043235472400000003-2024122604323642330000000a]
aws_iam_role_policy_attachment.test-attach: Refreshing state... [id=AmazonEBSCSIDriverRole-20241226043236301000000007]
module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=common-eks-cluster-20241226043235471800000001-20241226043236249400000004]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=common-eks-cluster-20241226043235471800000001-20241226043236265200000006]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=common-eks-cluster-20241226043235471800000001-20241226043236260500000005]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3557718324]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=02e10580-78ff-4a65-be74-445b1cf24ce2]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/common-eks]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::183631350996:policy/common-eks-cluster-ClusterEncryption20241226043257827400000010]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=common-eks-cluster-20241226043235471800000001-20241226043258306500000011]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0491d2e797e744cc1]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-00ecb231aa6794c77]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0ef9476176f5c8ff1]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0bca477b56b1140b5]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06b3841968e507322]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0cb890f09324d2b37]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08aab78b96bd0a4c5]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0cadcda90cbdf4cfd]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0fcb83086061aa8e3]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0067559a5263fe9ac]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b02077f46ea8729a]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f2278c72fcc298ec]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-041156176234b4197]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d17e8f8b96365daf]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-015bc539454911e9c]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1205543513]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2814668107]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2517249076]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-844468187]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1854278365]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3029881194]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-685174604]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-19993364]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3493421729]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-686673597]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1843017391]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08aab78b96bd0a4c51080289494]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0e6ee82ecf20c3185]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-09b88f1672e964b49]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-095a0b1384b760a3b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0bfb21ab27774bb3c]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-03a48fdf594dc4cd2]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c4389e3eadf2a29e]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0097f88b5c6785e33]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d17e8f8b96365daf1080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=common-eks]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-12-26T04:44:58Z]
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.aws_eks_access_entry.this["root_user"]: Refreshing state... [id=common-eks:arn:aws:iam::183631350996:root]
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=common-eks:arn:aws:iam::183631350996:role/IaC]
module.eks.module.eks_managed_node_group["example"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=3033770093735951495]
module.eks.module.eks_managed_node_group["example"].aws_launch_template.this[0]: Refreshing state... [id=lt-062f5d259fc1405eb]
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 0s [id=eks-pod-identity-agent]
module.eks.module.eks_managed_node_group["example"].aws_eks_node_group.this[0]: Refreshing state... [id=common-eks:example-20241226044504789600000014]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=99d41e43229a4cdaf4141f3e8310e6d95c31dab9]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::183631350996:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/647A0EE066A5603AB6D3A73F267FCF1C]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.aws_eks_access_policy_association.this["root_user_root_user"]: Refreshing state... [id=common-eks#arn:aws:iam::183631350996:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=common-eks#arn:aws:iam::183631350996:role/IaC#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.eks.aws_eks_access_entry.this["cluster_creator"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
      ~ access_entry_arn  = "arn:aws:eks:us-east-1:183631350996:access-entry/common-eks/role/183631350996/IaC/a8ca00a3-e36c-6939-0e03-c476c393bb6e" -> (known after apply)
      ~ created_at        = "2024-12-26T04:44:28Z" -> (known after apply)
      ~ id                = "common-eks:arn:aws:iam::183631350996:role/IaC" -> (known after apply)
      ~ kubernetes_groups = [] -> (known after apply)
      ~ modified_at       = "2024-12-26T04:44:28Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::183631350996:role/IaC" -> "arn:aws:iam::183631350996:role/IaC-ReadOnly" # forces replacement
      - tags              = {} -> null
      ~ user_name         = "arn:aws:sts::183631350996:assumed-role/IaC/{{SessionName}}" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_entry.this["github_action_ci"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "common-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::183631350996:role/IaC"
      + tags_all          = {
          + "Created_by"  = "Terraform"
          + "Environment" = "Common"
          + "Owner"       = "TF"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
      ~ associated_at = "2024-12-26 04:44:30.762 +0000 UTC" -> (known after apply)
      ~ id            = "common-eks#arn:aws:iam::183631350996:role/IaC#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2024-12-26 04:44:30.762 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::183631350996:role/IaC" -> "arn:aws:iam::183631350996:role/IaC-ReadOnly" # forces replacement
        # (2 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.aws_eks_access_policy_association.this["github_action_ci_github_action_ci"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "common-eks"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::183631350996:role/IaC"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = "v1.37.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "common-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = {
          + "Created_by"  = "Terraform"
          + "Environment" = "Common"
          + "Owner"       = "TF"
        }

      + pod_identity_association {
          + role_arn        = "arn:aws:iam::183631350996:role/AmazonEBSCSIDriverRole"
          + service_account = "ebs-csi-controller-sa"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.11.3-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "common-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = {
          + "Created_by"  = "Terraform"
          + "Environment" = "Common"
          + "Owner"       = "TF"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["eks-pod-identity-agent"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "eks-pod-identity-agent"
      + addon_version               = "v1.3.4-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "common-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = {
          + "Created_by"  = "Terraform"
          + "Environment" = "Common"
          + "Owner"       = "TF"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.31.2-eksbuild.3"
      + arn                         = (known after apply)
      + cluster_name                = "common-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = {
          + "Created_by"  = "Terraform"
          + "Environment" = "Common"
          + "Owner"       = "TF"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "vpc-cni"
      + addon_version               = "v1.19.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "common-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = {
          + "Created_by"  = "Terraform"
          + "Environment" = "Common"
          + "Owner"       = "TF"
        }

      + timeouts {}
    }

  # module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "common-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t2.medium",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "default-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0067559a5263fe9ac",
          + "subnet-06b3841968e507322",
          + "subnet-0fcb83086061aa8e3",
        ]
      + tags                   = {
          + "Name" = "default"
        }
      + tags_all               = {
          + "Created_by"  = "Terraform"
          + "Environment" = "Common"
          + "Name"        = "default"
          + "Owner"       = "TF"
        }
      + version                = "1.31"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 4
          + min_size     = 2
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "default-eks-node-group-"
      + path                  = "/"
      + tags_all              = {
          + "Created_by"  = "Terraform"
          + "Environment" = "Common"
          + "Owner"       = "TF"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for default EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "default-"
      + tags_all               = {
          + "Created_by"  = "Terraform"
          + "Environment" = "Common"
          + "Owner"       = "TF"
        }
      + update_default_version = true
      + vpc_security_group_ids = [
          + "sg-00ecb231aa6794c77",
        ]
        # (2 unchanged attributes hidden)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "default"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name" = "default"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name" = "default"
            }
        }
    }

  # module.eks.module.eks_managed_node_group["example"].aws_eks_node_group.this[0] will be destroyed
  # (because module.eks.module.eks_managed_node_group["example"] is not in configuration)
  - resource "aws_eks_node_group" "this" {
      - ami_type               = "AL2023_x86_64_STANDARD" -> null
      - cluster_name           = "common-eks" -> null
      - id                     = "common-eks:example-20241226044504789600000014" -> null
      - instance_types         = [
          - "t2.medium",
        ] -> null
      - node_group_name_prefix = "example-" -> null
      - node_role_arn          = "arn:aws:iam::183631350996:role/example-eks-node-group-20241226043235472400000003" -> null
      - subnet_ids             = [
          - "subnet-0067559a5263fe9ac",
          - "subnet-06b3841968e507322",
          - "subnet-0fcb83086061aa8e3",
        ] -> null
      - tags                   = {
          - "Name" = "example"
        } -> null
      - tags_all               = {
          - "Created_by"  = "Terraform"
          - "Environment" = "Common"
          - "Name"        = "example"
          - "Owner"       = "TF"
        } -> null
      - version                = "1.31" -> null

      - launch_template {
          - id      = "lt-062f5d259fc1405eb" -> null
            name    = null
          - version = "1" -> null
        }

      - scaling_config {
          - desired_size = 2 -> null
          - max_size     = 4 -> null
          - min_size     = 2 -> null
        }

      - timeouts {}

      - update_config {
          - max_unavailable            = 0 -> null
          - max_unavailable_percentage = 33 -> null
        }
    }

  # module.eks.module.eks_managed_node_group["example"].aws_iam_role.this[0] will be destroyed
  # (because module.eks.module.eks_managed_node_group["example"] is not in configuration)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::183631350996:role/example-eks-node-group-20241226043235472400000003" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = "EKSNodeAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-12-26T04:32:35Z" -> null
      - description           = "EKS managed node group IAM role" -> null
      - force_detach_policies = true -> null
      - id                    = "example-eks-node-group-20241226043235472400000003" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "example-eks-node-group-20241226043235472400000003" -> null
      - name_prefix           = "example-eks-node-group-" -> null
      - path                  = "/" -> null
      - tags_all              = {
          - "Created_by"  = "Terraform"
          - "Environment" = "Common"
          - "Owner"       = "TF"
        } -> null
      - unique_id             = "AROASVQKIBTKOIVFIDHL7" -> null
        # (1 unchanged attribute hidden)
    }

  # module.eks.module.eks_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be destroyed
  # (because module.eks.module.eks_managed_node_group["example"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "example-eks-node-group-20241226043235472400000003-20241226043236403400000009" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly" -> null
      - role       = "example-eks-node-group-20241226043235472400000003" -> null
    }

  # module.eks.module.eks_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be destroyed
  # (because module.eks.module.eks_managed_node_group["example"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "example-eks-node-group-20241226043235472400000003-2024122604323642330000000a" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy" -> null
      - role       = "example-eks-node-group-20241226043235472400000003" -> null
    }

  # module.eks.module.eks_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be destroyed
  # (because module.eks.module.eks_managed_node_group["example"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "example-eks-node-group-20241226043235472400000003-20241226043236391300000008" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy" -> null
      - role       = "example-eks-node-group-20241226043235472400000003" -> null
    }

  # module.eks.module.eks_managed_node_group["example"].aws_launch_template.this[0] will be destroyed
  # (because module.eks.module.eks_managed_node_group["example"] is not in configuration)
  - resource "aws_launch_template" "this" {
      - arn                                  = "arn:aws:ec2:us-east-1:183631350996:launch-template/lt-062f5d259fc1405eb" -> null
      - default_version                      = 1 -> null
      - description                          = "Custom launch template for example EKS managed node group" -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - id                                   = "lt-062f5d259fc1405eb" -> null
      - latest_version                       = 1 -> null
      - name                                 = "example-20241226044458704100000012" -> null
      - name_prefix                          = "example-" -> null
      - tags_all                             = {
          - "Created_by"  = "Terraform"
          - "Environment" = "Common"
          - "Owner"       = "TF"
        } -> null
      - update_default_version               = true -> null
      - vpc_security_group_ids               = [
          - "sg-00ecb231aa6794c77",
        ] -> null
        # (8 unchanged attributes hidden)

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
            # (2 unchanged attributes hidden)
        }

      - monitoring {
          - enabled = true -> null
        }

      - tag_specifications {
          - resource_type = "instance" -> null
          - tags          = {
              - "Name" = "example"
            } -> null
        }
      - tag_specifications {
          - resource_type = "network-interface" -> null
          - tags          = {
              - "Name" = "example"
            } -> null
        }
      - tag_specifications {
          - resource_type = "volume" -> null
          - tags          = {
              - "Name" = "example"
            } -> null
        }
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "02e10580-78ff-4a65-be74-445b1cf24ce2"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::183631350996:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::183631350996:role/IaC" -> "arn:aws:iam::183631350996:role/IaC-ReadOnly"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::183631350996:role/common-eks-cluster-20241226043235471800000001"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["default"].module.user_data.null_resource.validate_cluster_service_cidr will be created
  + resource "null_resource" "validate_cluster_service_cidr" {
      + id = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["example"].module.user_data.null_resource.validate_cluster_service_cidr will be destroyed
  # (because module.eks.module.eks_managed_node_group["example"].module.user_data is not in configuration)
  - resource "null_resource" "validate_cluster_service_cidr" {
      - id = "3033770093735951495" -> null
    }

Plan: 16 to add, 1 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @yashrajdighe, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-plan`*